MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAMD20E15B/mcu.h
/**
 * \brief Header file for ATSAMD20E15B
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-03-25T23:08:42Z */
#ifndef _SAMD20E15B_H_
#define _SAMD20E15B_H_

// Header version uses Semantic Versioning 2.0.0 (https://semver.org/)
#define HEADER_FORMAT_VERSION "2.0.0"

#define HEADER_FORMAT_VERSION_MAJOR (2)
#define HEADER_FORMAT_VERSION_MINOR (0)

/** \addtogroup SAMD20E15B_definitions SAMD20E15B definitions
  This file defines all structures and symbols for SAMD20E15B:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
 *  @{
 */

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  include <stdint.h>
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !defined(SKIP_INTEGER_LITERALS)
#  if defined(_U_) || defined(_L_) || defined(_UL_)
#    error "Integer Literals macros already defined elsewhere"
#  endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Macros that deal with adding suffixes to integer literal constants for C/C++ */
#  define _U_(x) (x ## U)    /**< C code: Unsigned integer literal constant value */
#  define _L_(x) (x ## L)    /**< C code: Long integer literal constant value */
#  define _UL_(x) (x ## UL)  /**< C code: Unsigned Long integer literal constant value */

#else /* Assembler */

#  define _U_(x) x    /**< Assembler: Unsigned integer literal constant value */
#  define _L_(x) x    /**< Assembler: Long integer literal constant value */
#  define _UL_(x) x   /**< Assembler: Unsigned Long integer literal constant value */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* SKIP_INTEGER_LITERALS */
/** @}  end of Atmel Global Defines */

/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR SAMD20E15B                                         */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** Interrupt Number Definition */
typedef enum IRQn
{
/******  CORTEX-M0PLUS Processor Exceptions Numbers ******************************/
  Reset_IRQn                = -15, /**< -15 Reset Vector, invoked on Power up and warm reset */
  NonMaskableInt_IRQn       = -14, /**< -14 Non maskable Interrupt, cannot be stopped or preempted */
  HardFault_IRQn            = -13, /**< -13 Hard Fault, all classes of Fault    */
  SVCall_IRQn               =  -5, /**< -5  System Service Call via SVC instruction */
  PendSV_IRQn               =  -2, /**< -2  Pendable request for system service */
  SysTick_IRQn              =  -1, /**< -1  System Tick Timer                   */
/******  SAMD20E15B specific Interrupt Numbers ***********************************/
  PM_IRQn                   =   0, /**< 0   Power Manager (PM)                  */
  SYSCTRL_IRQn              =   1, /**< 1   System Control (SYSCTRL)            */
  WDT_IRQn                  =   2, /**< 2   Watchdog Timer (WDT)                */
  RTC_IRQn                  =   3, /**< 3   Real-Time Counter (RTC)             */
  EIC_IRQn                  =   4, /**< 4   External Interrupt Controller (EIC) */
  NVMCTRL_IRQn              =   5, /**< 5   Non-Volatile Memory Controller (NVMCTRL) */
  EVSYS_IRQn                =   6, /**< 6   Event System Interface (EVSYS)      */
  SERCOM0_IRQn              =   7, /**< 7   Serial Communication Interface (SERCOM0) */
  SERCOM1_IRQn              =   8, /**< 8   Serial Communication Interface (SERCOM1) */
  SERCOM2_IRQn              =   9, /**< 9   Serial Communication Interface (SERCOM2) */
  SERCOM3_IRQn              =  10, /**< 10  Serial Communication Interface (SERCOM3) */
  TC0_IRQn                  =  13, /**< 13  Basic Timer Counter (TC0)           */
  TC1_IRQn                  =  14, /**< 14  Basic Timer Counter (TC1)           */
  TC2_IRQn                  =  15, /**< 15  Basic Timer Counter (TC2)           */
  TC3_IRQn                  =  16, /**< 16  Basic Timer Counter (TC3)           */
  TC4_IRQn                  =  17, /**< 17  Basic Timer Counter (TC4)           */
  TC5_IRQn                  =  18, /**< 18  Basic Timer Counter (TC5)           */
  ADC_IRQn                  =  21, /**< 21  Analog Digital Converter (ADC)      */
  AC_IRQn                   =  22, /**< 22  Analog Comparators (AC)             */
  DAC_IRQn                  =  23, /**< 23  Digital Analog Converter (DAC)      */
  PTC_IRQn                  =  24, /**< 24  Peripheral Touch Controller (PTC)   */

  PERIPH_MAX_IRQn           =  24  /**< Max peripheral ID */
} IRQn_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;
  /* Cortex-M handlers */
  void* pfnReset_Handler;                        /* -15 Reset Vector, invoked on Power up and warm reset */
  void* pfnNonMaskableInt_Handler;               /* -14 Non maskable Interrupt, cannot be stopped or preempted */
  void* pfnHardFault_Handler;                    /* -13 Hard Fault, all classes of Fault */
  void* pvReservedC12;
  void* pvReservedC11;
  void* pvReservedC10;
  void* pvReservedC9;
  void* pvReservedC8;
  void* pvReservedC7;
  void* pvReservedC6;
  void* pfnSVCall_Handler;                       /*  -5 System Service Call via SVC instruction */
  void* pvReservedC4;
  void* pvReservedC3;
  void* pfnPendSV_Handler;                       /*  -2 Pendable request for system service */
  void* pfnSysTick_Handler;                      /*  -1 System Tick Timer */

  /* Peripheral handlers */
  void* pfnPM_Handler;                           /*   0 Power Manager (PM) */
  void* pfnSYSCTRL_Handler;                      /*   1 System Control (SYSCTRL) */
  void* pfnWDT_Handler;                          /*   2 Watchdog Timer (WDT) */
  void* pfnRTC_Handler;                          /*   3 Real-Time Counter (RTC) */
  void* pfnEIC_Handler;                          /*   4 External Interrupt Controller (EIC) */
  void* pfnNVMCTRL_Handler;                      /*   5 Non-Volatile Memory Controller (NVMCTRL) */
  void* pfnEVSYS_Handler;                        /*   6 Event System Interface (EVSYS) */
  void* pfnSERCOM0_Handler;                      /*   7 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM1_Handler;                      /*   8 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM2_Handler;                      /*   9 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM3_Handler;                      /*  10 Serial Communication Interface (SERCOM3) */
  void* pvReserved11;
  void* pvReserved12;
  void* pfnTC0_Handler;                          /*  13 Basic Timer Counter (TC0) */
  void* pfnTC1_Handler;                          /*  14 Basic Timer Counter (TC1) */
  void* pfnTC2_Handler;                          /*  15 Basic Timer Counter (TC2) */
  void* pfnTC3_Handler;                          /*  16 Basic Timer Counter (TC3) */
  void* pfnTC4_Handler;                          /*  17 Basic Timer Counter (TC4) */
  void* pfnTC5_Handler;                          /*  18 Basic Timer Counter (TC5) */
  void* pvReserved19;
  void* pvReserved20;
  void* pfnADC_Handler;                          /*  21 Analog Digital Converter (ADC) */
  void* pfnAC_Handler;                           /*  22 Analog Comparators (AC) */
  void* pfnDAC_Handler;                          /*  23 Digital Analog Converter (DAC) */
  void* pfnPTC_Handler;                          /*  24 Peripheral Touch Controller (PTC) */
} DeviceVectors;

/* Defines for Deprecated Interrupt and Exceptions handler names */
#define pfnMemManage_Handler      pfnMemoryManagement_Handler     /**< \deprecated  Backward compatibility for ASF*/
#define pfnDebugMon_Handler       pfnDebugMonitor_Handler         /**< \deprecated  Backward compatibility for ASF*/
#define pfnNMI_Handler            pfnNonMaskableInt_Handler       /**< \deprecated  Backward compatibility for ASF*/
#define pfnSVC_Handler            pfnSVCall_Handler               /**< \deprecated  Backward compatibility for ASF*/

